<template>
  <div>
    <v-navbar
      title="ЕГЭ. Задание 11"
      has-home-button
    />

    <div class="columns">
      <div class="column">
        <section class="section">
          <div class="container">
            <p class="title is-5">
              Теория
            </p>
            <v-list-theory :theories="theories"/>
          </div>
        </section>
      </div>
      <div class="column">
        <section class="section">
          <div class="container">
            <p class="title is-5">
              Списки слов для закрепления
            </p>
            <div v-for="(trainings, i) of trainings_lists" :key="i" style="margin-top: 1.5rem">
              <v-list-training :trainings="trainings"/>
            </div>
          </div>
        </section>
      </div>
    </div>
</div>
</template>

<script>
import VNavbar from '../components/VNavbar.vue';
import VListTraining from '../components/VListTraining.vue';
import VListTheory from '../components/VListTheory.vue';

export default {
  name: 'Ege11HomeView',
  components: {
    VListTheory,
    VListTraining,
    VNavbar,
  },
  data() {
    return {
      theories: [
        {
          title: 'Существительные',
          text: '**Суффиксы `-ИК-` и `-ЕК-`**\n\nПишется буква `и`:\n\n- если в родительном падеже буква `и` остается.\n\nПишется буква `е`:\n\n- если в родительном падеже буква `е` выпадает.\n\nПримеры:\n\n- есть карандашик - нет карандашика\n- есть человечек - нет человечка\n\n---\n\n**Суффиксы `-ИЦ-` и `-ЕЦ-`**\n\nПишется буква `и`:\n\n- в словах женского рода;\n- в словах среднего рода, ударение которых падает на слог до суффикса.\n\nПишется буква `е` (она может выпадать при склонении):\n\n- в словах мужского рода;\n- в словах среднего рода, ударение которых падает на слог после суффикса;\n- в родительном падеже множественной формы некоторых слов среднего рода с\nсуффиксом `-Ц-`.\n\nПримеры:\n\n- красавица (ж. р.)\n- красавец (м. р.)\n- бельецо (ср. р., ударение на `о`)\n- зданьице (ср. р., ударение на `а`)\n- есть блюдца - нет блюдец (ср. р. в именительном падеже суффикс `-Ц-`)\n- есть щупальца - нет щупалец (ср. р. в именительном падеже суффикс `-Ц-`)\n\n---\n\n**Суффиксы `-ИЧК-` и `-ЕЧК-`**\n\nПишется буква `и`:\n\n- если слово образовано от слова с суффиксом `-ИЦ-`;\n- если слово образовано от сокращенного мужского имени на `-ИК`.\n\nПишется буква `е` во всех остальных случаях, например:\n\n- если слово образовано от слова с суффиксом `-ЕК`;\n- если слово образовано от слова на `-МЯ`;\n- и так далее.\n\nВажно:\n\n- В русском языке нет безударного суффикса `-ЯЧК-`.\n\nПримеры:\n\n- лестничка (от лестница)\n- книжечка (от книга)\n- семечко (от семя)\n- Валечка (от Валя)\n- Эдичка (от Эдик)\n- Аличка (от Алик)\n\n---\n\n**Суффиксы `-ИНК-` и `-ЕНК-`**\n\nПишется буква `и`:\n\n- в словах, образованных от слов женского рода на `-ИНА`.\n\nПишется буква `е` во всех остальных случаях, например:\n\n- в существительных женского рода, обозначающих лиц женского пола;\n- и так далее.\n\nИсключения:\n\n- горлинка\n\nПримеры:\n\n- соломинка (от соломина)\n- француженка\n- монашенка\n\n---\n\n**Суффиксы `-ОНЬК-` и `-ЕНЬК-`**\n\nПишется буква `о`:\n\n- После твердых согласных.\n\nПишется буква `е`:\n\n- После мягких согласных;\n- После шипящих согласных;\n- После гласных.\n\nИсключения:\n\n- паинька\n- заинька\n- баиньки\n\nПримеры:\n\n- лисонька\n- тученька\n- Зоенька\n- душенька\n\n---\n\n**Суффиксы рода занятий `-ЧИК-` и `-ЩИК-`**\n\nПишется буква `ч`:\n\n- После согласных `д`-`т`, `з`-`с`, `ж`.\n\nПишется буква `щ`:\n\n- После остальных согласных;\n- После `т` в некоторых иноязычных словах, если их основа оканчивается на две согласные.\n\nВажно:\n\n- `-ЧИК-` может быть еще уменьшительно-ласкательным суффиксом, поэтому надо отличать слово "барабанщик" от слова "барабанчик".\n\nПодсказка:\n\n- Все согласные, после которых пишется буква `ч`, есть в словосочетании "ЗоСя ЖДеТ".\n\nПримеры:\n\n- перевозчик\n- разносчик\n- банщик\n- фонарщик\n- асфальтщик\n- процентщик\n\n---\n\n**Неизменяемые суффиксы**\n\nНекоторые постоянные суффиксы:\n\n- `-ИЗН-`: белизна, желтизна;\n- `-ИН-`: вышина, ширина;\n- `-ИНСТВ-`: большиство, достоинство;\n- `-ЕСТВ-`: студентчество, творчество;\n- `-ТЕЛЬ-`: учитель, строитель;\n- `-ЁР-`: комбанёр.\n\nВажно:\n\n- В суффиксе `-ИНСТВ-` обычно пишется буква `и`, но есть слово "первенство", которое пишется через букву `е`.\n\n---\n\n**Правописание слов, образованных от существительных на `-МЯ`**\n\nПишется буква `я`:\n\n- в сложных словах, содержащих в первом корне слово на `-МЯ`.\n\nПишется буква `е` во всех остальных случаях, например:\n\n- если это глагол, образованный от слова на `-МЯ`;\n- и так далее.\n\nИсключения:\n\n- знаменосец\n\nПримеры:\n\n- семядоля\n- семяпочка\n- семя - нет семени\n- пламя - над пламенем\n- бремя - обременить',
        },
        {
          title: 'Прилагательные',
          text: '**Суффиксы `-ИВ-` и `-ЕВ-`**\n\nПишется буква `и`:\n\n- Если гласная в суффиксе под ударением.\n\nПишется буква `е`:\n\n- Если гласная в суффиксе безударная.\n\nИсключения:\n\n- милостивый\n- юродивый\n\nВажно:\n\n- В суффиксах `-ЛИВ-`, `-ЧИВ-` всегда пишется буква `и`, например: заботливый.\n\nПримеры:\n\n- льстивый\n- правдивый\n- боевой\n- сиреневый\n\n---\n\n**Суффиксы `-ОВ-`, `-ОВАТ-`, `-ОВИТ-` и `-ЕВ-`, `-ЕВАТ-`, `-ЕВИТ-`**\n\nПишется буква `о`:\n\n- Если суффикс стоит после твердых согласных.\n\nПишется буква `е`:\n\n- Если суффикс стоит после мягких согласных, шипящих и буквы `ц`.\n\nПримеры:\n\n- деловой\n- красноватый\n- вечевой\n- глянцевитый\n\n---\n\n**Суффиксы `-ОНЬК-` и `-ЕНЬК-`**\n\nПишется буква `о`:\n\n- После согласных `г`, `к`, `ж`.\n\nПишется буква `е`:\n\n- После всех остальных согласных.\n\nПримеры:\n\n- легонький\n- дешевенький\n\n---\n\n**Неизменяемые суффиксы**\n\nНекоторые постоянные суффиксы:\n\n- `-ЛИВ-`, `-ЧИВ-`: заботливый, обманчивый;\n- `-ИСТ-`, `-ЕСК-`, `-ЧЕСК-`: надрывистый.\n- `-ЧАТ-`: створчатый, ступенчатый, решетчатый;\n- `-АТ-`, `-АН-`: дощатый.',
        },
        {
          title: 'Наречия',
          text: '**Суффиксы `-О-` и `-А-` наречий, образованных приставочно-суффиксальным способом**\n\nПишется буква `о`:\n\n- В наречиях с приставками `ИЗ-`, `ДО-`, `С-`.\n\nПишется буква `а`:\n\n- В наречиях с приставками `В-`, `НА-`, `ЗА-`.\n\nВажно:\n\n- Наречия могут быть образованы чисто суффиксальным способом. В таком случае, это правило не работает. Пример: досрочный + `-О-` = досрочно.\n\nПодсказка:\n\n- Можно воспользоваться правилом "окна" для проверки написания этих суффиксов. Если перед окном поставить приставку наречия, то гласная на конце слова будет совпадать с гласной, которую необходимо будет поставить в суффиксе наречия. Например, "из окна" - "изредка", "с окна" - "справа".\n\nПримеры:\n\n- изредка\n- добела\n- снова\n- вправо\n- наглухо\n- запросто',
        },
      ],
      trainings_lists: [
        [
          {
            title: 'Существительные с суффиксами -ИК- и -ЕК-',
            topic: 'ege11-nouns-ik-ek',
            type: 'card',
          },
          {
            title: 'Существительные с суффиксами -ИЦ- и -ЕЦ-',
            topic: 'ege11-nouns-ic-ec',
            type: 'card',
          },
          {
            title: 'Существительные с суффиксами -ИЧК- и -ЕЧК-',
            topic: 'ege11-nouns-ichk-echk',
            type: 'card',
          },
          {
            title: 'Существительные с суффиксами -ИНК- и -ЕНК-',
            topic: 'ege11-nouns-ink-enk',
            type: 'card',
          },
          {
            title: 'Существительные с суффиксами -ОНЬК- и -ЕНЬК-',
            topic: 'ege11-nouns-onk-enk',
            type: 'card',
          },
          {
            title: 'Существительные с суффиксами -ЧИК- и -ЩИК-',
            topic: 'ege11-nouns-chik-shik',
            type: 'card',
          },
          {
            title: 'Существительные с неизменяемыми суффиксами',
            topic: 'ege11-nouns-const',
            type: 'card',
          },
          {
            title: 'Существительные на -МЯ',
            topic: 'ege11-nouns-mya',
            type: 'card',
          },
        ],
        [
          {
            title: 'Прилагательные с суффиксами -ИВ- и -ЕВ-',
            topic: 'ege11-adjs-iv-ev',
            type: 'card',
          },
          {
            title: 'Прилагательные с суффиксами -ОНЬК- и -ЕНЬК-',
            topic: 'ege11-adjs-onk-enk',
            type: 'card',
          },
          {
            title: 'Прилагательные с суффиксами -ОВ-, -ОВАТ-, -ОВИТ- и -ЕВ-, -ЕВАТ-, -ЕВИТ-',
            topic: 'ege11-adjs-ov-ev',
            type: 'card',
          },
          {
            title: 'Прилагательные с неизменяемыми суффиксами',
            topic: 'ege11-adjs-const',
            type: 'card',
          },
        ],
        [
          {
            title: 'Наречия с суффиксами -О- и -А- (приставочно-суффиксальные)',
            topic: 'ege11-advs-o-a',
            type: 'card',
          },
        ],
      ],
    };
  },
};
</script>

<style scoped>
</style>
