<template>
  <div>
    <v-navbar
      title="ЕГЭ. Задание 11"
      has-home-button
    />

    <div class="columns">
      <div class="column">
        <section class="section">
          <div class="container">
            <p class="title is-5">
              Теория
            </p>
            <v-list-theory :theories="theories"/>
          </div>
        </section>
      </div>
      <div class="column">
        <section class="section">
          <div class="container">
            <p class="title is-5">
              Списки слов для закрепления
            </p>
            <v-list-training :trainings="trainings"/>
          </div>
        </section>
      </div>
    </div>
</div>
</template>

<script>
import VNavbar from '../components/VNavbar.vue';
import VListTraining from '../components/VListTraining.vue';
import VListTheory from '../components/VListTheory.vue';

export default {
  name: 'Ege11HomeView',
  components: {
    VListTheory,
    VListTraining,
    VNavbar,
  },
  data() {
    return {
      theories: [
        {
          title: 'Существительные',
          text: '**Суффиксы `-ИК-` и `-ЕК-`**\n\nПишется буква `и`:\n\n- если в родительном падеже буква `и` остается.\n\nПишется буква `е`:\n\n- если в родительном падеже буква `е` выпадает.\n\nПримеры:\n\n- есть карандашик - нет карандашика\n- есть человечек - нет человечка\n\n---\n\n**Суффиксы `-ИЦ-` и `-ЕЦ-`**\n\nПишется буква `и`:\n\n- в словах женского рода;\n- в словах среднего рода, ударение которых падает на слог до суффикса.\n\nПишется буква `е` (она может выпадать при склонении):\n\n- в словах мужского рода;\n- в словах среднего рода, ударение которых падает на слог после суффикса;\n- в родительном падеже множественной формы некоторых слов среднего рода с\nсуффиксом `-Ц-`.\n\nПримеры:\n\n- красавица (ж. р.)\n- красавец (м. р.)\n- бельецо (ср. р., ударение на `о`)\n- зданьице (ср. р., ударение на `а`)\n- есть блюдца - нет блюдец (ср. р. в именительном падеже суффикс `-Ц-`)\n- есть щупальца - нет щупалец (ср. р. в именительном падеже суффикс `-Ц-`)\n\n---\n\n**Суффиксы `-ИЧК-` и `-ЕЧК-`**\n\nПишется буква `и`:\n\n- если слово образовано от слова с суффиксом `-ИЦ-`;\n- если слово образовано от сокращенного мужского имени на `-ИК`.\n\nПишется буква `е` во всех остальных случаях, например:\n\n- если слово образовано от слова с суффиксом `-ЕК`;\n- если слово образовано от слова на `-МЯ`;\n- и так далее.\n\nВажно:\n\n- В русском языке нет безударного суффикса `-ЯЧК-`.\n\nПримеры:\n\n- лестничка (от лестница)\n- книжечка (от книга)\n- семечко (от семя)\n- Валечка (от Валя)\n- Эдичка (от Эдик)\n- Аличка (от Алик)\n\n---\n\n**Суффиксы `-ИНК-` и `-ЕНК-`**\n\nПишется буква `и`:\n\n- в словах, образованных от слов женского рода на `-ИНА`.\n\nПишется буква `е` во всех остальных случаях, например:\n\n- в существительных женского рода, обозначающих лиц женского пола;\n- и так далее.\n\nИсключения:\n\n- горлинка\n\nПримеры:\n\n- соломинка (от соломина)\n- француженка\n- монашенка\n\n---\n\n**Правописание слов, образованных от существительных на `-МЯ`**\n\nПишется буква `я`:\n\n- в сложных словах, содержащих в первом корне слово на `-МЯ`.\n\nПишется буква `е` во всех остальных случаях, например:\n\n- если это глагол, образованный от слова на `-МЯ`;\n- и так далее.\n\nИсключения:\n\n- знаменосец\n\nВажно:\n\n- Существительных на `-МЯ` всего 10: время, бремя, семя, вымя, стремя, пламя, племя, темя, знамя, имя.\n\nПримеры:\n\n- семядоля\n- семяпочка\n- семя - нет семени\n- пламя - над пламенем\n- бремя - обременить',
        },
      ],
      trainings: [
        {
          title: 'Существительные с суффиксами -ИК- и -ЕК-',
          topic: 'ege11-nouns-ik-ek',
          type: 'card',
        },
        {
          title: 'Существительные с суффиксами -ИЦ- и -ЕЦ-',
          topic: 'ege11-nouns-ic-ec',
          type: 'card',
        },
        {
          title: 'Существительные с суффиксами -ИЧК- и -ЕЧК-',
          topic: 'ege11-nouns-ichk-echk',
          type: 'card',
        },
        {
          title: 'Существительные с суффиксами -ИНК- и -ЕНК-',
          topic: 'ege11-nouns-ink-enk',
          type: 'card',
        },
        {
          title: 'Существительные с суффиксами -ОНЬК- и -ЕНЬК-',
          topic: 'ege11-nouns-onk-enk',
          type: 'card',
        },
        {
          title: 'Существительные на -МЯ',
          topic: 'ege11-nouns-mya',
          type: 'card',
        },
      ],
    };
  },
};
</script>

<style scoped>
</style>
