<template>
  <div align="center">
    <h1>ОРФОЭПИЯ</h1>
    <div class="text">
      <p>Добро пожаловать в тренажёр для закрепления орфоэпических норм.</p>
      <p>Данный тренажёр предлагает в случайном порядке проблемные слова из одного из нижеприведённых списков, ваша цель - правильно назвать у слов ударение.</p>
      <p>После того, как вы один раз ответили на каждое слово в списке, тренажёр будет предлагать слова вновь, в этот раз приоритизируя те, в которых у вас были ошибки.</p>
      <p>Если вы хотите проверить произношение некоторого слова, не дожидаясь вопроса, вы можете навести курсор на это слово в столбце слева, и правильное произношение будет вам показано.</p>
      <p>Тренажёр заканчивает предлагать вопросы, если последний ваш ответ на каждое слово был правильным.</p>
      <p>Выберите список слов, которые вы будете закреплять:</p>
    </div>
    <div class="button"><a href="training?q=0">Версия-прототип: всего 4 слова</a></div>
    <div class="button"><a href="training?q=1">Имена существительные</a></div>
    <div class="button"><a href="training?q=2">Имена прилагательные</a></div>
    <div class="button"><a href="training?q=3">Глаголы</a></div>
    <div class="button"><a href="training?q=4">Причастия</a></div>
    <div class="button"><a href="training?q=5">Деепричастия</a></div>
    <div class="button"><a href="training?q=6">Наречия</a></div>
    <div class="button"><a href="training?q=7">Все части речи</a></div>
    <div class="text">
      <p>Если вы не уверены в своих знаниях, вы можете почитать теоретическую часть:</p>
    </div>
    <div class="button"><a href="orthoepy/article">Статья по орфоэпии</a></div>
    <div class="text">
      <p>Вернуться к темам:</p>
    </div>
    <div class="button"><a href="">Обратно</a></div>
  </div>
</template>

<script>
export default {
  name: 'Orthoepy',
};
</script>
