<template>
  <div align="center">
    <h1>Н/НН</h1>
    <div class="text">
      <p>Добро пожаловать в тренажёр для закрепления правописания Н/НН.</p>
      <p>Данный тренажёр предлагает в случайном порядке проблемные слова из одного из нижеприведённых списков, ваша цель - правильно назвать у слов написание.</p>
      <p>После того, как вы один раз ответили на каждое слово в списке, тренажёр будет предлагать слова вновь, в этот раз приоритизируя те, в которых у вас были ошибки.</p>
      <p>Если вы хотите проверить написание некоторого слова, не дожидаясь вопроса, вы можете навести курсор на это слово в столбце слева, и правильное написание будет вам показано.</p>
      <p>Тренажёр заканчивает предлагать вопросы, если последний ваш ответ на каждое слово был правильным.</p>
      <p>Выберите список слов, которые вы будете закреплять:</p>
    </div>
    <div class="button"><a href="training?q=8">Исключения</a></div>
    <div class="text">
      <p>Вернуться к темам:</p>
    </div>
    <div class="button"><a href="javascript:history.back()">Обратно</a></div>
  </div>
</template>

<script>
export default {
  name: 'SingleOrDoubleN',
};
</script>
